src/InformationRegisters/ВерсииКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВерсииКлассификаторов</Name>
			<Comment>Версии классификаторов, которые используется в программе.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Номер версии загруженного классификатора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьАвтоматически</Name>
					<Comment>Регулирует необходимость автоматического обновления классификатора</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаРазделенныхДанных</Name>
					<Comment>Указывает на необходимость дополнительной обработки данных областей после загрузки классификатора при работе в модели сервиса. </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеДанные</Name>
					<Comment>В модели сервиса используется для определения режима распространения данных (загружать в общие данные/ тиражировать по областям)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьФайлВКэш</Name>
					<Comment>Указывает на необходимость сохранения файла в кэше поставляемых данных при работе в модели сервиса.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор классификатора на Портале 1С:ИТС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/КлассификаторНоменклатурыМедицинскихУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторНоменклатурыМедицинскихУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ЗагрузкаКлассификатораУслуг/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы, Описатель) Экспорт
	
	Описатель.Идентификатор			 	 = ИдентификаторКлассификатора();
	Описатель.Наименование           	 = НСтр("ru = 'Классификатор услуг'");
	Описатель.ОбновлятьАвтоматически     = Ложь;
	Описатель.ОбщиеДанные 				 = Истина;
	Описатель.ОбработкаРазделенныхДанных = Ложь;
	Описатель.СохранятьФайлВКэш 		 = Истина;
	
	Классификаторы.Добавить(Описатель);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры) Экспорт
	
	Если Идентификатор <> ИдентификаторКлассификатора() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
	ДвоичныеДанные     = ПолучитьИзВременногоХранилища(Адрес);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ЗагрузитьДанныеИзФайла(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Обработан = Истина;
	
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторКлассификатора()
	
	Возврат "MedServices";
	
КонецФункции

// Процедура - Загрузить данные из файла
//
// Параметры:
//  ИмяФайла - 	 - 
//
Процедура ЗагрузитьДанныеИзФайла(ИмяФайла)
	
	Попытка
		
		МассивСтрок = Новый Массив;
		Файл        = Новый ЧтениеТекста(ИмяФайла);
		Строка      = Файл.ПрочитатьСтроку();
		Если Строка = Неопределено Тогда
			 ЗаписатьОшибкуВЖурналРегистрации("В файде импорта нет данных.");
			 Возврат;
		КонецЕсли;
		Строка          = Файл.ПрочитатьСтроку();
		КоличествоСтрок = 0;
		КоличествоЗагруженныхУслуг = 0;
		Пока Строка <> Неопределено Цикл
			
			Строка = Файл.ПрочитатьСтроку();
			Если Строка <> Неопределено Тогда
				
				МассивСтрок.Добавить(Строка);
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Файл.Закрыть();
		
		КоличествоЗагруженныхУслуг = ДобавитьДанныеВКлассификаторУслуг(МассивСтрок);
		
		Информация = "Загружено: " + КоличествоСтрок + ", создано услуг: " + КоличествоЗагруженныхУслуг;
		ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации(), УровеньЖурналаРегистрации.Информация,,, Информация);
		
	Исключение
		ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция ИмяСобытияВЖурналеРегистрации()
	
	Возврат НСтр("ru = 'Загрузка классификатора услуг'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

// Процедура - Добавить данные в классификатор услуг
//
// Параметры:
//  МассивСтрок	 - 	 - 
//
Функция ДобавитьДанныеВКлассификаторУслуг(МассивСтрок) Экспорт
	
	КоличествоЗагруженныхУслуг = 0;
	Для Каждого Строка Из МассивСтрок Цикл
		
		МассивПодстрок = СтрРазделить(Строка, ";", Истина);
		
		Если МассивПодстрок.Количество() <> 7 Тогда
			ЗаписатьОшибкуВЖурналРегистрации("Неверный формат файла загрузки.");
			Возврат 0;
			Прервать;
		КонецЕсли; 
		
		Наименование        = МассивПодстрок[0];
		НаименованиеПолное  = МассивПодстрок[1];
		НормаВремени 		= МассивПодстрок[2];
		ЭтоГруппа           = МассивПодстрок[3];
		РодительСтрока		= МассивПодстрок[4];
		КодУслуги		    = МассивПодстрок[5];
		ЧислоУЕТ		    = МассивПодстрок[6];
		
		НайденныйЭлемент = ПроверитьСуществующий(Наименование, ЭтоГруппа, РодительСтрока, КодУслуги);
		
		Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ЭтоГруппа = "Нет" Тогда
			
			НовыйЭлемент				    = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.СоздатьЭлемент();
			НовыйЭлемент.Наименование       = Наименование;
			НовыйЭлемент.НормаВремени 		= НормаВремени;
			НовыйЭлемент.Код     	     	= КодУслуги;
			НовыйЭлемент.УЕТ                = ЧислоУЕТ;
			
			Если ЗначениеЗаполнено(РодительСтрока) Тогда
				НайденныйЭлемент = ПроверитьСуществующий(РодительСтрока, Истина, Неопределено, КодУслуги);
				
				Если Не ЗначениеЗаполнено(НайденныйЭлемент) Тогда
					
					НоваяГруппа				        = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.СоздатьГруппу();
					НоваяГруппа.Наименование        = РодительСтрока;
					НоваяГруппа.Записать();
					Родитель = НоваяГруппа.Ссылка;
					КоличествоЗагруженныхУслуг = КоличествоЗагруженныхУслуг + 1;
				Иначе
					Родитель = НайденныйЭлемент;
				КонецЕсли;
				
				НовыйЭлемент.Родитель = Родитель;
				
			КонецЕсли;
			
			НовыйЭлемент.Записать();
			
		Иначе
			
			НоваяГруппа				        = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.СоздатьГруппу();
			НоваяГруппа.Наименование        = Наименование;
            НоваяГруппа.Записать();
			
		КонецЕсли;
		КоличествоЗагруженныхУслуг = КоличествоЗагруженныхУслуг + 1;
		
	КонецЦикла;

	Возврат КоличествоЗагруженныхУслуг;
	
КонецФункции

&НаСервере
Функция ПроверитьСуществующий(Наименование, ЭтоГруппаСтрока, РодительСтрока, КодУслуги)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторНоменклатурыМедицинскихУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторНоменклатурыМедицинскихУслуг КАК КлассификаторНоменклатурыМедицинскихУслуг
		|ГДЕ
		|	КлассификаторНоменклатурыМедицинскихУслуг.Наименование = &Наименование
		|	И КлассификаторНоменклатурыМедицинскихУслуг.ЭтоГруппа = &ЭтоГруппа
		|	И КлассификаторНоменклатурыМедицинскихУслуг.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &РодительСтрока <> НЕОПРЕДЕЛЕНО
		|				ТОГДА КлассификаторНоменклатурыМедицинскихУслуг.Родитель.Наименование = &РодительСтрока
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КодУслуги <> НЕОПРЕДЕЛЕНО
		|					И КлассификаторНоменклатурыМедицинскихУслуг.ЭтоГруппа = ЛОЖЬ
		|				ТОГДА КлассификаторНоменклатурыМедицинскихУслуг.Код = &КодУслуги
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	РодительСтрока = ?(ЗначениеЗаполнено(РодительСтрока), РодительСтрока, Неопределено);
	ЭтоГруппа = ?(ЭтоГруппаСтрока = "Нет", Ложь, Истина);
	Запрос.УстановитьПараметр("Наименование"  , Наименование);
	Запрос.УстановитьПараметр("ЭтоГруппа"     , ЭтоГруппа);
	Запрос.УстановитьПараметр("РодительСтрока", РодительСтрока);
	Запрос.УстановитьПараметр("КодУслуги"     , ?(ЗначениеЗаполнено(КодУслуги), КодУслуги, Неопределено));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Процедура - Отключить автоматическое обновление
//
Процедура ОтключитьАвтоматическоеОбновление() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсииКлассификаторов.Идентификатор КАК Идентификатор,
	|	ВерсииКлассификаторов.Версия КАК Версия,
	|	ВерсииКлассификаторов.ДатаОбновления КАК ДатаОбновления,
	|	ВерсииКлассификаторов.Наименование КАК Наименование,
	|	ВерсииКлассификаторов.ОбновлятьАвтоматически КАК ОбновлятьАвтоматически,
	|	ВерсииКлассификаторов.ОбработкаРазделенныхДанных КАК ОбработкаРазделенныхДанных,
	|	ВерсииКлассификаторов.ОбщиеДанные КАК ОбщиеДанные,
	|	ВерсииКлассификаторов.СохранятьФайлВКэш КАК СохранятьФайлВКэш
	|ИЗ
	|	РегистрСведений.ВерсииКлассификаторов КАК ВерсииКлассификаторов
	|ГДЕ
	|	ВерсииКлассификаторов.Идентификатор = &Идентификатор
	|	И ВерсииКлассификаторов.ОбновлятьАвтоматически = ИСТИНА";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторКлассификатора());
	
	ВыборкаИдентификатора = Запрос.Выполнить().Выбрать();
	Если ВыборкаИдентификатора.Следующий() Тогда
		Попытка
			НаборЗаписейВерсииКлассификаторов = РегистрыСведений.ВерсииКлассификаторов.СоздатьНаборЗаписей();
			НаборЗаписейВерсииКлассификаторов.Отбор.Идентификатор.Установить(ВыборкаИдентификатора.Идентификатор);
			Запись = НаборЗаписейВерсииКлассификаторов.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаИдентификатора);
			Запись.ОбновлятьАвтоматически = Ложь;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейВерсииКлассификаторов);
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
